[
  {
    "title": "First Blog Post",
    "date": "2025-08-25",
    "image": "https://picsum.photos/800/400", 
    "content": "This is the full content of my first blog post. It supports long text paragraphs, so I can write everything I want."
  },
  {
    "title": "Second Blog Post",
    "date": "2025-08-20",
    "image": "",
    "content": "This post doesn’t have an image. When the image field is blank, it just shows a neutral gray banner."
  }
  {
    "title": "My adventure at Undercity! A 4-day hardware hackathon @ Github HQ",
    "date": "July 15, 2025",
    "banner": "imagesundercity-ppl.png",
    "content": I was filled with emotions as we pulled up to GitHub HQ. I was excited to learn from others who knew what they were doing, but I was nervous because it was my first hackathon. As I entered, I checked in with the GitHub and Hackclub staff, received a wristband, and was greeted at the swag table.&nbsp;</p> <p dir="ltr">I didn&rsquo;t really know anyone, so I just stood at the swag table. After a while, someone asked the guy stationing the swag table his opinion on GitHub Copilot, as it seemed that he was an employee. It turned out that he worked at Vercel and just decided to help out with this event. So the guy who asked him asked if he could get infinite Vercel Pro credits, as Vercel has no student plan. Surprisingly, he said that he can work out something if he is a part of an organization. I asked if I could get the same deal, but I don&rsquo;t have an organization. He was really shocked that I was 12 and I was at such a complex hackathon where most people were around 16. He gave me his email and told me that if I start a club next school year, then he can definitely work something for us.</p> <p dir="ltr">For the next few hours, I just wandered around, walking in circles, hoping to find a team to work with. Everyone was already working on so many projects with materials from home. It seemed like everybody except me had a team. I spent a few hours working on a top-secret coding project, and before I knew it, it was time for the opening ceremony. They covered basic stuff like food, sleeping, and more essentials. At the end of the ceremony, right as I was about to stand in line for the food, I got a DM on Slack from Jake. I started talking to Jake a few weeks ago. He reached out to me when I posted my speaker project, and he shared his own project. We got to know each other, and we became good friends. Initially, he wasn&rsquo;t gonna come because his project had not been approved yet, so he had not gotten the invite, but apparently, he just got it 3 days before the event and decided to surprise me. So we met up and we searched for a 3rd person because teams were of three. Then we saw Alfonso, who was walking around and confused. We quickly talked to him, and he said he&rsquo;d join our team as he, too, was lost.</p> <p dir="ltr">After we finished dinner, we found a spot to sit down and think of project ideas. We immediately turned to ChatGPT. I feel like half of all of their requests came from all the hackathon participants. Turns out ChatGPT isn&rsquo;t really creative and just came up with weird ideas that wouldn&rsquo;t really catch people&rsquo;s attention. So we opened 8 AI chatbots ranging from Google&rsquo;s Gemini to Microsoft&rsquo;s Copilot, all the way to Perplexity. None of them had ideas. That was when Jake had an idea! &ldquo;What if we make a drone?&rdquo; he said. I liked the concept, but I thought that was a bit too common. So we settled on an RC Flying Airplane. Then we realised that there was no way we could get an RC transmitter or receiver. So we settled on controlling it using a website, and we headed to sleep.</p> <p dir="ltr">We searched for a place on the 2nd floor as it had conference rooms allocated for sleeping. We found one, and as it was late, the lights had already been dimmed. I found a place on the side of a table to sleep near the outlet so I could charge my devices. I set an alarm on my phone to wake me up at 6:30.&nbsp;</p> <p dir="ltr">In the morning, we first had bagels for breakfast, and then we set to work. We found out that the two TVs in the conference room had a code on them that you could enter in Zoom to screen share to them. Jake connected his iPad to the TVs, and we started to make a game plan using the TVs. We had a 4-hour outdoor lunch, which was the only time we would be let out. So we started by calling several nearby shops to see if they had drone motors. The motors they had at the hackathon were designed to lift more, and they spun slower than regular drone motors. Sadly, none of the electronics shops sold the stuff we were looking for. Then I had a brilliant idea! We each were going to be given a $20 bill to buy lunch. If we pool that money together, we get $60, so we can buy a large pizza, and then we can spend the rest on a drone to scrap from parts. We first decided to buy the drone. We found a Target and hoped they had a drone. On the way, we saw the San Francisco Museum of Modern Art, or MoMA. Jake said he really wanted to go there, so I told him that if we found a drone and ate lunch, then we would. The Target we found was inside a mall, so we entered the mall from a side entrance and took the elevator up. We headed for the tech section, as that would be our best bet. The people there told us that they unfortunately didn&rsquo;t have any drones. We then decided to try the toy section as a last resort. They had a drone there, but it was super small and it was around $50. I then suggested that we go to Best Buy because I think they have drones there. We had walked to Target, but then Jake told me that the Munni public transport was free, so we took the bus to Best Buy. At Best Buy, we immediately got distracted and started playing with the Nintendo Switch 2s, and then we recalled why we came there. We found a cheap, moderately sized drone for $30, and we bought it. I then searched for a nearby Domino&rsquo;s so we could split a large pizza. The Domino&rsquo;s we stopped at was really small, and although the kitchen was full-sized, the part where the customers stood was less than 6 feet wide and 4 feet long. We got a large pizza for $22 and everyone got 3 slices. Then, as promised to Jake, we headed to the MoMA. There was no entry fee to get in for students, so all three of us got in really fast. We only had 20 minutes left before we had to go back to GitHub HQ, so we raced to see everything. I don&rsquo;t really get why people like to see modern art, as it can be just random at times. For example, we saw a blue square on the wall and they called it art. We quickly wrapped up the MoMA and headed back to HQ.</p> <p dir="ltr">As soon as we were back, we started to disassemble the drone. While we were disassembling the drone, someone who had made a flying airplane before gave us a bunch of advice. He told us how to angle and design everything for optimal flight. After we had just had the motors and propellers, we decided to see exactly if they could make us fly. So we built a small circuit and attached it to a piece of cardboard, and it worked! It was getting late, so we ate dinner and decided to head to bed.&nbsp;</p> <p dir="ltr">Right as I was about to climb the staircase, I saw that they were doing tours, so I told my team that we should join them. On the tour, we learned about GitHub HQ&rsquo;s history, we checked out the roof, we got to see the situation room, and we got to enter the secret room! It was quite late by the end of the tour, so we had to head straight to bed.</p> <p dir="ltr">In the morning, I told my team that we really needed to focus on completing our project. I started by writing a web server to run on our Raspberry Pi Zero 2 W that could show us a livestream from a camera and had buttons to fly the drone. I had to learn how Flask worked so we could set up the backend with Python, which allowed us to interface with the GPIO pins, as they also ran in Python. While I was busy setting up the backend, Jake was designing the skeleton of the airplane. On which we were going to place our components, and then we were going to wrap it in paper to fly. I built a basic site with buttons, but I couldn&rsquo;t get the camera to work for some reason. There were practically no modules and documentation on how to use the camera. Most of the modules failed when I tried to download them, as they were too outdated and not supported on the latest operating system. Finally, after searching a lot, I found out that there was a small library that was built into the operating system for simple purposes. I hooked it up to the Python script and then embedded the Python script into the HTML, and it worked! Finally, even if nothing else worked, I had something to show. I then tried to learn CSS for the first time to make our site look good. I figured out how to round corners and how to center elements. We actually had a nice site! I was really proud of all my work, and now all that was left was to check out the airplane skeleton that Jake made and to wire everything up.&nbsp;</p> <p dir="ltr">I was just about to go downstairs and check on Jake when he burst into the room. He designed and printed the skeleton, but he made a massive mistake. He accidentally made the rods the same size as the slots! This meant that it wouldn&rsquo;t slide in and lock everything together. So now he went downstairs and decided to use the soldering iron to just heat the plastic up and to stick pieces together. Meanwhile, we were trying to put the circuit together, and we realised that the battery for the drone wasn&rsquo;t going to power a whole Raspberry Pi Zero 2 W. It needed a constant supply of 5V, and our battery was 3.7V. Surprisingly, they didn&rsquo;t have a boost converter to step up the voltage! So we searched around, hoping that someone had brought one from home. After searching a lot, we finally found someo</p> <p dir="ltr">ne that actually had one. However, there was a huge problem, it was massive. Regular boost converters are pretty small and lightweight, but this one was like 4 times the size of a normal one, and it was double the weight of our whole setup so far. And that wasn&rsquo;t the end of it. We also needed a battery that could store more energy, and the only battery they had that could store a lot was also pretty big and heavy, as it was a 9V battery.&nbsp;</p> <p dir="ltr">We knew then that our project was pretty much over, and it was so close to becoming real if only they had stocked the two components that we needed. Disappointed, but still happy that we got to learn so much and experience so much, we decided to end the project as a concept and the working demo as a webcam. It wasn&rsquo;t just us who had called it quits. Many people had half-functioning projects because of the lack of the right parts. So we filmed a demo video and shipped our project to their platform and headed to bed.</p> <p dir="ltr">In the morning, we set up our gallery, and we took turns explaining our concept airplane to people, and when it wasn&rsquo;t our turn, we would check out the other projects. There were very few fully finished projects, but the ones that were either were super simple, like an e-ink display that shows notifications, or used parts from home, like a chocolate maker with the nozzle and heater from home, with a bunch of 3D printed parts from their own 3D printer. We got to learn a lot about what we should do for future hackathons and tips next time, like my partner had a 3D printer, but he didn&rsquo;t bring it, and if he had, then we wouldn&rsquo;t have to wait in the long 17-hour queues. The winning project was a toilet paper folder, which was simple, but the idea was funny and creative, so everyone voted for it. It was a motor attached to a 3d printed square that turned toilet paper and folded it a certain number of times using rotation. This kind of project gives me ideas for future projects at future hackathons I go to. After demos and voting, we packed up and attended the closing ceremony. After saying goodbye to Jake and Alfonso, we checked out and headed our separate ways. Although we didn&rsquo;t have a fully complete project for this hackathon, as we tackled something complex without looking at our limited parts, we still learned a lot. And I feel like the learning was more important than actually shipping a project. So I'rsquo;ll apply all my new knowledge to the next hackathon I go to, and who knows, maybe my team and I will win it!
  }

"Witnessing a Masterpiece of our Time": {
  "title": "Witnessing a Masterpiece of our Time",
  "date": "September 10, 2025",
  "banner": "gta5.png",
  "content": "<p>&nbsp; &nbsp; &nbsp;&ldquo;I&rsquo;m getting too old for this nonsense&rdquo;, that was the moment I knew I witnessed a masterpiece. This Labor Day, I finally finished GTA V, and I picked the Deathwish ending. The game had given me the choice of killing Trevor or killing Michael, but I couldn&rsquo;t betray either of them, no matter how imperfect they were. Deathwish felt like the right ending because it matched the chaotic and friendship-driven way of the game.<br>Franklin was my favorite character to play as. He felt like the perfect balance of the other two, smart and wealth-hungry like Michael, and he had a lot of Trevor&rsquo;s loyalty towards his friends. He was good at planning during heists and helped his friends even when it wasn&rsquo;t his battle. That combination made him the character I wanted to be, the perfect balance of personalities.<br>&nbsp; &nbsp; &nbsp;The hardest part for me was escaping Merryweather to escape with gold from &lsquo;The Big Score&rsquo;. It made sense to send a private militia to protect 4 tons of gold. Waves and waves of their mercenaries kept coming, and it felt endless, but I pushed through. The hardest part was switching from one character to another to make sure none of them died because the mercenaries attacked all of us at once, and we were scattered across the parking lot. The 20 million payout afterwards felt good, though. Once I finished the story and had about twenty million, I put aside five hundred and used the rest to buy a ton of Merryweather stock. I thought owning a big piece of the company that tried to kill us would be the perfect example of irony.&nbsp;<br>The story had all sorts of unexpected twists and turns. Finding out Michael had lied to Trevor about Brad being alive was shocking. I was actually relieved when Trevor didn&rsquo;t kill Michael and chose to forgive him. That tiny bit of mercy in the middle of the chaos showed that Trevor is a good person. There couldn&rsquo;t have been a better ending than pushing Devin Weston off the cliff and taking out all my characters&rsquo; other enemies, all in one night. The sunrise set the mood perfectly, along with the song, &ldquo;The Set Up&rdquo;.<br>&nbsp; &nbsp; &nbsp;The PlayStation App says I spent fifty-eight hours on GTA! I played an hour or two every evening all summer, and on Labor Day, I decided to finish it and played for 3.5 hours. Throughout, I focused on the main missions and saved side quests for later, but I kept getting sidetracked while exploring the open world. I got lost in flying planes and zooming down the highway at two hundred miles per hour.<br>&nbsp; &nbsp; &nbsp;Early on, I hated the default car that each character spawns with because it was slow and looked bad, so each time I found a faster car. Near the end, when I needed cars for The Big Score and had to upgrade the ones I found, I realized I could also customize the default cars. I decked them out with side lights, a bright orange paint job, a carbon fiber spoiler and hood, maxed braking and speed upgrades, bulletproof tires, and limo-style windows. It handled better than most supercars I found, and if I crashed it, it would respawn fixed. Being able to see it on the map made it easy to find, and I used it much more often now.<br>&nbsp; &nbsp; &nbsp;During the credits, I had the thought of working for Rockstar Games, the creator of GTA, and helping make GTA 7. So I went straight to Rockstar&rsquo;s jobs page and found that most positions are in-person. The closest office is in Los Angeles, and I am only willing to relocate as far as San Francisco, so unfortunately, I will not be able to help with the next masterpiece. Still, I am extremely excited for GTA 6. GTA V is 11 years old and still looks realistic. With the rumored budget and a map with multiple cities, I expect the next game to feel even more life-like.<br>&nbsp; &nbsp; &nbsp;No matter how annoying or hard a mission was, I never skipped cutscenes. I bought this game to play it, not just to finish it, and skipping the missions and cutscenes would have felt like not experiencing the whole game, which is why I bought it. The hard, tedious parts still make the game what it is.<br>&nbsp; &nbsp; &nbsp;A few practical things I learned along the way might save you time. Always save before big missions because things go sideways. During Lester&rsquo;s assassination missions, invest in the competitors of the companies Lester tells you to sabotage. The stock will surge once you complete the mission, and you can sell for an insanely high return. Another tip is to buy Downtown Cab Co. because it is the fastest way to get across the map, and it lets you skip long car rides, which is also handy when you respawn at the hospital or when you want to travel across the map. Also, upgrade your main car early with speed, brakes, bulletproof tires, and carbon parts for speed and performance. A modded findable car is way better than the stock supercars that are slower and handle worse.<br>&nbsp; &nbsp; &nbsp;GTA V was a wild, chaotic story of a friendship that made my summer epic. From Franklin&rsquo;s loyalty to Trevor&rsquo;s unpredictability and Michael&rsquo;s ruthlessness and dedication to his family, the game made me laugh, gasp, and made the characters grow on me. If I replay it, Downtown Cab Co. is gonna be my first major purchase, and my custom car will be fully decked out from day one. If I redo the missions, then I will choose a different route than I did the first time, because for each mission, Lester gives you a choice on how you want to do it. GTA 5 was absolute cinema if you look past the violence and profanity. Right now, I am impatient for GTA 6, and I am hopeful that Rockstar will deliver a bigger, better, richer, and even more realistic experience.</p>"
  }

]
