[
  {
    "id": "Witnessing a Masterpiece of our Time",
    "title": "Witnessing a Masterpiece of our Time",
    "date": "September 10, 2025",
    "banner": "images/gta5.png",
    "content": "&nbsp; &nbsp; &nbsp;“I’m getting too old for this nonsense”, that was the moment I knew I witnessed a masterpiece. This Labor Day, I finally finished GTA V, and I picked the Deathwish ending. The game had given me the choice of killing Trevor or killing Michael, but I couldn’t betray either of them, no matter how imperfect they were. Deathwish felt like the right ending because it matched the chaotic and friendship-driven way of the game.<br>&nbsp; &nbsp; &nbsp;Franklin was my favorite character to play as. He felt like the perfect balance of the other two, smart and wealth-hungry like Michael, and he had a lot of Trevor’s loyalty towards his friends. He was good at planning during heists and helped his friends even when it wasn’t his battle. That combination made him the character I wanted to be, the perfect balance of personalities.<br>&nbsp; &nbsp; &nbsp;The hardest part for me was escaping Merryweather to escape with gold from ‘The Big Score’. It made sense to send a private militia to protect 4 tons of gold. Waves and waves of their mercenaries kept coming, and it felt endless, but I pushed through. The hardest part was switching from one character to another to make sure none of them died because the mercenaries attacked all of us at once, and we were scattered across the parking lot. The twenty million payout afterwards felt good, though.<br>&nbsp; &nbsp; &nbsp;Once I finished the story and had about twenty million, I put aside five hundred and used the rest to buy a ton of Merryweather stock. I thought owning a big piece of the company that tried to kill us would be the perfect example of irony.<br>&nbsp; &nbsp; &nbsp;The story had all sorts of unexpected twists and turns. Finding out Michael had lied to Trevor about Brad being alive was shocking. I was actually relieved when Trevor didn’t kill Michael and chose to forgive him. That tiny bit of mercy in the middle of the chaos showed that Trevor is a good person. There couldn’t have been a better ending than pushing Devin Weston off the cliff and taking out all my characters’ other enemies, all in one night. The sunrise set the mood perfectly, along with the song, “The Set Up”.<br>&nbsp; &nbsp; &nbsp;The PlayStation App says I spent fifty-eight hours on GTA! I played an hour or two every evening all summer, and on Labor Day, I decided to finish it and played for 3.5 hours. Throughout, I focused on the main missions and saved side quests for later, but I kept getting sidetracked while exploring the open world. I got lost in flying planes and zooming down the highway at two hundred miles per hour.<br>&nbsp; &nbsp; &nbsp;Early on, I hated the default car that each character spawns with because it was slow and looked bad, so each time I found a faster car. Near the end, when I needed cars for The Big Score and had to upgrade the ones I found, I realized I could also customize the default cars. I decked them out with side lights, a bright orange paint job, a carbon fiber spoiler and hood, maxed braking and speed upgrades, bulletproof tires, and limo-style windows. It handled better than most supercars I found, and if I crashed it, it would respawn fixed. Being able to see it on the map made it easy to find, and I used it much more often now.<br>&nbsp; &nbsp; &nbsp;During the credits, I had the thought of working for Rockstar Games, the creator of GTA, and helping make GTA 7. So I went straight to Rockstar’s jobs page and found that most positions are in-person. The closest office is in Los Angeles, and I am only willing to relocate as far as San Francisco, so unfortunately, I will not be able to help with the next masterpiece. Still, I am extremely excited for GTA 6. GTA V is 11 years old and still looks realistic. With the rumored budget and a map with multiple cities, I expect the next game to feel even more life-like.<br>&nbsp; &nbsp; &nbsp;No matter how annoying or hard a mission was, I never skipped cutscenes. I bought this game to play it, not just to finish it, and skipping the missions and cutscenes would have felt like not experiencing the whole game, which is why I bought it. The hard, tedious parts still make the game what it is.<br>&nbsp; &nbsp; &nbsp;A few practical things I learned along the way might save you time. Always save before big missions because things go sideways. During Lester’s assassination missions, invest in the competitors of the companies Lester tells you to sabotage. The stock will surge once you complete the mission, and you can sell for an insanely high return. Another tip is to buy Downtown Cab Co. because it is the fastest way to get across the map, and it lets you skip long car rides, which is also handy when you respawn at the hospital or when you want to travel across the map. Also, upgrade your main car early with speed, brakes, bulletproof tires, and carbon parts for speed and performance. A modded findable car is way better than the stock supercars that are slower and handle worse.<br>&nbsp; &nbsp; &nbsp;GTA V was a wild, chaotic story of a friendship that made my summer epic. From Franklin’s loyalty to Trevor’s unpredictability and Michael’s ruthlessness and dedication to his family, the game made me laugh, gasp, and made the characters grow on me. If I replay it, Downtown Cab Co. is gonna be my first major purchase, and my custom car will be fully decked out from day one. If I redo the missions, then I will choose a different route than I did the first time, because for each mission, Lester gives you a choice on how you want to do it. GTA 5 was absolute cinema if you look past the violence and profanity. Right now, I am impatient for GTA 6, and I am hopeful that Rockstar will deliver a bigger, better, richer, and even more realistic experience.<br><br><br><br>"
  },
  {
    "id": "Daydream SV",
    "title": "Organizing Daydream Silicon Valley",
    "date": "October 1, 2025",
    "banner": "images/daydream.png",
    "content": "&nbsp; &nbsp; &nbsp;Daydream SV was a game jam on the weekend of the 27th of September 2025. It is the first hackathon I have ever organized, and I thought it was gonna be scary, but it wasn’t. It was actually fun! After Undercity ended at GitHub HQ, they told everyone during the closing ceremony that you could apply to run your own Daydream in your city. So I did. I applied for Silicon Valley, and somehow, I got it.<br>&nbsp; &nbsp; &nbsp;We started planning in early August. We were emailing sponsors for money while the tech team built the website all month long. Then September was all about food, prizes, and activities. Finally in the last two weeks before the event, we were just marketing it in our community. We had 160 signups, but only 50 people showed up! And we planned food for 90. So we had six trays of Panda Express and eight boxes of Costco pizza left over. We gave five boxes of pizza to a group of kids walking outside the library. One of them was a 7th grader, just a year younger than me, and he folded the pizza and shoved it down his throat like it was a speedrun. He finished the whole box in just 30 seconds. We gave him two more boxes and two to his friend. He’s probably gonna show up to every hackathon he can find for food now.<br>&nbsp; &nbsp; &nbsp;At the end, we still had food left, so we gave some to a homeless couple sleeping outside the library. They ate one box of Panda Express sparingly and put the rest on their shopping cart. The next morning, when I came back for Day 2, I saw the same kids from the day before sitting outside waiting for the library to open. Their parents had dropped them off three hours before the library opened. One of the kids had red and purple marks on his arms and legs. I asked if he got hurt. His friend, the pizza inhaler, started to say something about his parents, but the kid aggressively cut him off. I’m actually concerned for him.<br>&nbsp; &nbsp; &nbsp;Our venue was the community room at the Alum Rock branch of the San Jose Public Library. It was small, but we would make it work. Everyone who entered the main library building looked homeless because almost all of them had bags of clothes and shopping carts. My parents were actually scared to send me at first. There was even some blood spilled next to a payphone marked with hazard tape! At least we had a TV hooked up to a PC so we could play music the whole time. The mic was bad, but we were all so excited that our voices became the mic.<br>&nbsp; &nbsp; &nbsp;I was bored at first. Everyone just started building their games right away, and I thought something would happen after the opening ceremony, but nope. So I played Minecraft Bedwars for a while. But one can only play so much Bedwars. That’s when I remembered activities. Undercity had lightning talks, what should Daydream SV have? That’s when it hit me: karaoke. I made a signup list and announced it. Everyone loved the idea. I sang “Never Gonna Give You Up,” “The Final Countdown,” and “Danger Zone,” and I also jumped into other songs impromptu. During the whole time, we were on a video call with other Daydreams, and they got jealous, so they hosted karaoke too! The vibes and energy during the karaoke was in my mind, the highlight of the event.<br>&nbsp; &nbsp; &nbsp;Some people were beginners, but the electricity in the air fueled people to learn new things. We hosted a Godot workshop, but people were too locked in on self-study and focused on their games. Everyone made a good game, like a game I’d actually play in my free time. One guy made a pixelated Super Smash Bros. style game from scratch with really nice sprites and backgrounds.<br>&nbsp; &nbsp; &nbsp;My favorite, though, was “I (don’t) like you.” It was wild! You meet Mr. Nice Guy, an NPC whose kid’s birthday is today, and then two seconds later, you come across a well blocking your path. You have to sacrifice Mr. Nice Guy by throwing him into the well to destroy it and to cross. I was not expecting that at all! It was such a good use of the theme “Sacrifices must be made.” The animation of throwing different NPCs down wells as you progress was perfect. No wonder they won first place.<br>&nbsp; &nbsp; &nbsp;Our sponsor, Playdate, donated three Playdate consoles for first place. Each one is $200+ and has an amazing open-source game dev community. For second place, I used my past keyboard research and picked up the EA75. A creamy-sounding keyboard with RGB lights. For third place, we almost forgot, so I asked in the Discord what we should get. People said headphones. I found the Soundcore Q20 by Anker. With a 60-hour battery life and Active Noise Cancelling, it was an absolute steal.<br>&nbsp; &nbsp; &nbsp;I was the youngest on the team. I was in finance and marketing. But, in addition to that, I planned all the food, picked the second and third place prizes, and was the only one who ordered a physical debit card from the Hack Club bank page. That card came in clutch when we had to print flyers for our sponsor using the library’s ancient printer.<br>&nbsp; &nbsp; &nbsp;Daydream SV is over now, but the memories will continue to live on. I organized an event that helped people build cool stuff. That’s absolutely wild. Now I know it’s not scary to run a hackathon. I’ve got the tools and experience for all the future hackathons I’m gonna run. I’ve already started planning one at my school: Wolverine Hacks 2026. I’ve set up the signup link, Discord, project submission link, and website at: <a href='https://wolverine-hacks.vercel.app/' target='_blank'>https://wolverine-hacks.vercel.app/</a>. It is gonna be the first hackathon at my school and maybe the first hackathon in the Bay Area organized by only Middle Schoolers!<br>&nbsp; &nbsp; &nbsp;If you want to learn more about Daydream Silicon Valley, check out <a href='https://daydream.hackclub.com/sv' target='_blank'>https://daydream.hackclub.com/sv</a>. It was more than a hackathon. It was a spiritual retreat.<br><br><br><br>"
  },
  {
    "id": "makerhacksii",
    "title": "Makerhacks II: Robots, Coding, and Tony's Mistake",
    "date": "October 21, 2025",
    "banner": "images/idk.png",
    "content": "&nbsp; &nbsp; &nbsp;I didn&rsquo;t actually plan on going to Makerhacks II. It all started when I got added to a group chat on the Hack Club Slack with my Undercity teammate and two other people I had met there. I asked why I was even in the chat, and they said they were forming a team for Makerhacks. Since we all lived in the Bay Area and already knew each other, I said yes. That&rsquo;s how I ended up joining.</p> <p>&nbsp; &nbsp; &nbsp;The day of the event was packed. I had a mandatory Science Olympiad meeting from 10:15 to 1, and check-in for Makerhacks ended at 3. I arrived at 2:30, just in time. Right as I got there, the No Kings protest was about to begin, and the police had blocked off the road to cars. I had to walk uphill to the venue, and the whole time I was nervous about getting robbed by someone on the street. It wasn&rsquo;t the best start.</p> <p>&nbsp; &nbsp; &nbsp;Makerhacks II had two tracks: open prototype and robotics challenge. We chose robotics since it was the main focus and sounded more exciting. Our robot was a four-wheel-drive bulldozer powered by an ESP32. I worked on the UDP code so it could receive WASD controls from a Python script and act like a Wi-Fi router. When I arrived, my teammates were struggling to get all four motors working. I looked at the code and saw they had set all the motor pins to low. Each motor needed one pin high and the other low. I fixed it, and that was the moment our robot actually came to reality.</p> <p>&nbsp; &nbsp; &nbsp;We made it to the semifinals, which was a surprise to us. In our match, we thought we were up against Evan, who&rsquo;s a hardware genius in Hack Club. We assumed we were done for. Turns out, we were actually on his alliance and had just been standing on the wrong side of the field. Our team went for the orbs and managed to collect all of them, but the other team focused on the control modules, which were worth more points. We lost by a small margin and ended up in fourth place. If we had made it into the top three, we would have won a 3D printer. Everyone on my team already had one except me, so they agreed I could keep it if we won. I was really close to finally having one for my hardware projects.</p> <p>&nbsp; &nbsp; &nbsp;The worst part of the event was the dinner delay. It was supposed to arrive at 7 pm, but it didn&rsquo;t show up for another two and a half hours. All the organizers had already ordered their own food through DoorDash, and we kept asking when ours would come. Eventually, two of them gave in and admitted they had paid a guy named Tony, who worked for Frontier Tower, the venue, to handle the catering. Tony messed up big time. I&rsquo;m still annoyed at him.</p> <p>&nbsp; &nbsp; &nbsp;Aside from the food situation, the rest of the event was pretty good. Some teams used PS4, PS5, and Xbox controllers to drive their robots, which was way easier than using a keyboard. I&rsquo;m definitely bringing my PS5 controller next time. I didn&rsquo;t see many unique robots besides the team that beat us, but the controller idea was smart and made a big difference in performance.</p> <p>&nbsp; &nbsp; &nbsp;Overall, I had a good time. I learned how UDP works and how to debug motor logic. I got to work with my friends, compete in a real robotics challenge, and I almost won a 3D printer. Makerhacks II was chaotic, a little stressful, but also really fun. Next time, I&rsquo;ll come with a controller, a better robot, and absolutely zero trust in Tony.<br><br><br><br>"
  },
  {
    "id": "mhsinv25",
    "title": "My Wake-Up Call",
    "date": "November 12, 2025",
    "banner": "",
    "content": "<div>&nbsp;</div> <div> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;I wasn&rsquo;t exactly sure what to expect from the first Science Olympiad tournament of the season. It was the Milpitas High Invitational on November 8th, 2025, and it was actually their first time hosting an invitational. Although they&rsquo;ve done regional tournaments, the qualifiers for state, this was a big deal. Just to be on the team for my school (Thomas Russell Middle School), we had to take a test at the start of the year. Sixty kids tried out, but only the top 25 test scores got in, including me. I wasn't too shocked that I had made the team, as I had also made it last year. Nonetheless, I was still excited. This tournament brought 35 teams from around the Bay Area. Our district, the same one as Milpitas High, had two middle schools, us and Rancho Middle School, but everyone else was from outside.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;The tournament taking place at our high school made it extremely convenient to travel to because it&rsquo;s only about 1000 feet from my middle school. And surprisingly, we got there early. When I arrived, the place was buzzing with teams setting up their build projects in the gym and settling down on tables outside. It was cool seeing all these other kids talking about interesting science concepts, but it also made me realize how competitive it was going to be.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;This season, I have three events. Circuit Lab, where you solve problems about electrical circuits, like calculating voltages and currents or understanding components. Codebusters, which is all about cracking different kinds of ciphers and codes, from simple letter substitutions to more complex ones with modulus involved. And Hovercraft, where you build and race a device that hovers and moves entirely on air. Unfortunately, this tournament didn&rsquo;t have Hovercraft, so I only competed in the first two. I thought Circuit Lab would be my favorite because I spent the summer learning about PCBs and designing actual circuits. But to my surprise, the test was all theoretical, heavy on the math, and had nothing about building stuff. It was a really big letdown. Codebusters on the other hand surprised me. There&rsquo;s this huge dopamine rush that you get when you finally crack a cipher after staring at it forever. So that ended up being my favorite.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;Once during Circuit Lab, we had to figure out the voltage or current at a point after it passed through several resistors. But the image of the circuit was printed so poorly that we couldn&rsquo;t make out the color bands on the resistors. We even mistook a three-band resistor for a two-band one because the edges blended into the rest of the resistor. I don't think anyone was able to solve that problem!</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;For Circuit Lab, I had one partner, Vivaan, and he was also one of my two partners for Codebusters. In Codebusters, my second partner, Shaurya, didn&rsquo;t help much. We basically had to solve the ciphers he was supposed to solve. It was frustrating, but we continued on by dividing up the work, checking each other&rsquo;s progress, and attempting to teach Shaurya some of the chipers.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;Throughout both events, there were always challenges. Circuit Lab covers a broad range of topics, meaning our notes couldn&rsquo;t cover everything. We were scrambling to remember formulas and concepts we had completely forgotten to put in our notes. One question asked for the full name of the person who came up with Coulomb&rsquo;s Law. And although our notes had the law and that his last name was Coulomb, we never thought that his first name would be relevant. Luckily, I spotted it hidden in a tiny paragraph about someone else. However, in Codebusters, it was mostly about racing the clock. We learned that we should&rsquo;ve learned Xenocrypt. It&rsquo;s a cipher encrypted in Spanish that you have to translate to English afterward, but it&rsquo;s worth points equal to three regular questions. We skipped it because of the hard language part, and that could have boosted our score.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;With so many smart schools there, and us being a bit clueless on some parts (plus one of my partners not studying for Codebusters), I wasn&rsquo;t expecting any medals. We ended up 14th in Circuit Lab and 16th in Codebusters out of all the teams. Just as I was ready to accept defeat, I saw one of my friends, Sid, who just joined Science Olympiad this year, win two medals! He got 2nd in Helicopter even though his device broke during testing. And for Remote Sensing, he was literally assigned it 15 minutes before the test, and had zero time to study, and still managed to get 2nd out of 35 teams by guessing on the multiple-choice questions. I think he got lucky, because Helicopter was a trial event and most teams didn&rsquo;t bring devices, and our school being so close meant we had ours ready. But still, seeing that sparked a fire under me I knew I had to step up my game for the next tournaments.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;From the whole experience, I learned what to expect on the Circuit Lab test: way more math and theory than hands-on stuff. For Codebusters, I&rsquo;ve got to master Xenocrypt to max out points, and study common double letters like &ldquo;ee,&rdquo; &ldquo;ss,&rdquo; &ldquo;ll,&rdquo; plus frequent two-letter and three-letter words for Aristocrat ciphers. At the end of the day, Codebusters is all about patterns, and any cipher besides Baconian can be solved as an Aristocrat.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;If you&rsquo;re planning to compete in these in the future, here are some tips that could get you some medals: Don't skip studying Xenocrypt, it&rsquo;s worth the extra struggle for those large points. Next, learn resistor color bands inside out so bad print quality doesn&rsquo;t trip you up. Also, write down the first names of everyone important, like inventors, because tests love to catch you unprepared. And finally, don&rsquo;t rely on your partner(s). You should know whatever they&rsquo;re supposed to learn, just in case.</p> <p dir=\"auto\">&nbsp; &nbsp; &nbsp;Overall, the Milpitas Invitational was a wake-up call for me, in a good way. It was chaotic with all the teams and events running at once, but it got me excited for the rest of the season. I&rsquo;m already planning to allocate more time to studying for Science Olympiad for Mira Loma. If my friend can wing it and get 2nd in both of his events, I should be able to get first with preparation. Science Olympiad is hard, but it&rsquo;s the kind of challenge that helps you get more interested in Science, like I did with Codebusters.</p> </div><br><br><br><br>"
  },
  {
    "id": "thanksgiving25",
    "title": "A Real <i>Thanks</i> giving",
    "date": "December 3, 2025",
    "banner": "",
    "content": "<p>This week I had the entire week off for Thanksgiving break, which was amazing after months of going to school at 8 am and coming home at 2:30 pm, more than 6 hours. This week I slept in until 10 am every day, catching up on all the sleep I’d lost from school. Once I finally had enough sleep, I would spend the morning getting ahead on school homework and studying for my Science Olympiad events (Circuit Lab, Codebusters, Hovercraft). I was quite productive as I got a lot of work finished without having to stress about any deadlines or anything else. Finally to wrap it all up, I would go play Basketball outside with my friends for 2 hours and then I would play video games for 3 hours with them.</p><p>My family doesn’t really celebrate Thanksgiving in the traditional sense. So there was no turkey or any relatives coming over. Instead we went out to a nice restaurant to eat, just the 3 of us. However, this thanksgiving I did something special. I focused more on the \"Thanks\" part. Instead of just saying the plain phrase \"Happy Thanksgiving\" or \"Thank you for everything\", I really took the time to write a heartfelt letter about all the things that my parents do for me that I am thankful for. It really made me realize how much they do that I often overlook and has made me more grateful.</p><p>After Thanksgiving came the real highlight of the entire week, Black Friday, but the deals had already started on Monday. I had been watching a keyboard, the Epomaker EA75, for a few months now, and during this week, it dropped from $80 to $40 on Amazon, so I grabbed it instantly! Also on Amazon, I finally got a proper chair for $80 because my old one was just one of the dining table chairs that was really uncomfortable. Then on the day of Black Friday we went to Great Mall in-person. This year the crowds were way smaller than last year or the years before. Most people were only buying a few things that they actually needed instead of filling up four shopping bags just because stuff was on sale like the years prior. I think the tariffs, high prices, recent layoffs, and the government shutdown drained everyone's wallets and it led to less extra money for shopping. However, luckily while we were there I found Gran Turismo 7 for $30 instead of its normal price of $70. It’s supposed to be one of the most realistic driving simulators ever and one of the best Playstation Exclusives, so I had to play it.</p><p>Once we got home, I immediately wanted to play Gran Turismo, but it had to download and that took a while as it took up 100 gigabytes. So to make use of the time, I decided to set up the Christmas tree with my parents. My parents let me try it out on my own this time, and I struggled a bit at first confused how to assemble it, but it was all worth it when it lit up. We decorated the tree with a set of Silver, Gold, and Blue ornaments to match the snowy design of the tree and it looked amazing. Just about the time that I finished, Gran Turismo finished downloading.</p><p>Gran Turismo was amazing. It had a great map with some of the most famous tracks of the world in the Americas, Europe, and Asia. Not only were the tracks super realistic and detailed, but the cars were a 1:1 replica of the actual ones. I unlocked a Tesla in the game and it looked just like my Tesla with the screen on the inside working just like it does in real life. Keeping the realistic and detailed theme, driving was not easy. It was like no racing game before, the settings were advanced and I could modify everything about the car including the ABS, Suspension, Torque and many more things. In most racing games for fun, you have great handling over the car, but Gran Turismo is designed to be like real life racing, not fun racing (which is what makes it fun), so it was very very easy to spinout and lose control over your car. I went out of the track for the first 50 turns as you need to have a perfect balance of breaking, speed, and turning to not only make the turn, but also to win the race. It took a while, but soon I understood how to turn. You start on the outside of the track, and then you move to the inside of the turn hitting the apex, and then you exit to the outside of the turn to finish.</p><p>After a while, I decided to take a break from Gran Turismo to play Fortnite with my Friends and to check out the new season. Before I logged on, I decided to watch the live event to get the backstory of this chapter, and I was greeted by a 6-7 joke which was questionable and funny at the same time. But the laughter didn't last long as they then eliminated the Battle Bus driver. So now we have to surf in on waves instead of jumping from the bus. It’s much more slower and you can only land on the outer edges of the map, which takes away some of the fun of previous chapters. And even though the new UI looks super clean and futuristic with rounded corners and a bold font, I actually miss the old one. The old UI was what I pictured when I thought of Fortnite.</p><p>Overall the break was relaxed, productive, and really fun. I caught up on sleep, progressed on goals, found amazing deals, shot hoops, and reflected on all the things that I am grateful. I'd say this was the best thanksgiving break ever!</p><br><br><br><br><br><br><br><br>"
  }
]
